app/controllers/appointment_controller.rb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @appointment = Appointment.find(params['appointments']['id'])